# Pandas: Formatos diferentes de entrada e sa√≠da (IO)

## Criando os nomes

In [1]:
import pandas as pd

In [2]:
nomes_f = pd.read_json('https://renatanesio.github.io/nomes_ibge/nomes-f.json')
nomes_m = pd.read_json('https://renatanesio.github.io/nomes_ibge/nomes-m.json')

In [3]:
nomes_f.sample(5)

         nome  regiao    freq  rank sexo
155   CECILIA       0  104228   156    F
103     KATIA       0  163299   104    F
44   RAIMUNDA       0  295061    45    F
179   LILIANE       0   88064   180    F
39       ROSA       0  306336    40    F

In [4]:
nomes_m.sample(5)

        nome  regiao    freq  rank sexo
139    OSMAR       0  102717   140    M
28   LEANDRO       0  506483    29    M
155  EMANUEL       0   82536   156    M
92     DIOGO       0  155247    93    M
195   WALTER       0   67207   196    M

In [5]:
print("Quantidade de nomes:" + str(len(nomes_f) + len(nomes_m)))

Quantidade de nomes:400

In [6]:
frames = [nomes_f, nomes_m]

In [7]:
nomes = pd.concat(frames)['nome'].to_frame()
nomes.sample(5)

         nome
101    SILVIO
150  EDMILSON
1         ANA
104       EVA
195    ROSANE

## Incluindo ID dos alunos

In [8]:
import numpy as np
np.random.seed(123)

In [9]:
total_alunos = len(nomes)
total_alunos

400

In [10]:
nomes['id_aluno'] = np.random.permutation(total_alunos) + 1

In [11]:
nomes.sample(5)

          nome  id_aluno
188    POLIANA       369
57      DAIANE       303
3    FRANCISCO       382
182    CHARLES        33
30    ANDERSON       111

In [12]:
dominios = ['@dominiodoemail.com.br', '@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios, total_alunos)

In [13]:
nomes.sample(5)

          nome  id_aluno                 dominio
84    SEVERINO        78  @dominiodoemail.com.br
0         JOSE       331     @servicodoemail.com
179       IAGO       340  @dominiodoemail.com.br
10      SANDRA       174  @dominiodoemail.com.br
171  TERESINHA        45  @dominiodoemail.com.br

In [14]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [15]:
nomes.sample(5)

       nome  id_aluno                 dominio                         email
114  ARTHUR       320  @dominiodoemail.com.br  arthur@dominiodoemail.com.br
57   DAIANE       303     @servicodoemail.com     daiane@servicodoemail.com
85   HELENA       221  @dominiodoemail.com.br  helena@dominiodoemail.com.br
183   IRACI         8  @dominiodoemail.com.br   iraci@dominiodoemail.com.br
189   DALVA       137  @dominiodoemail.com.br   dalva@dominiodoemail.com.br